//============================================================================================================
// # 1 Напишите пргограмму, которая на вход принимает два числа и проверяет,
// является ли первое число квадратом второго
//============================================================================================================

String? inputLine = Console.ReadLine();
if (inputLine != null)
{
    int inputNumber = int.Parse(inputLine);

    if (inputNumber % 2 == 0) 

    {
        Console.WriteLine("четное ");
    }
    if (inputNumber % 2 == 1)
    {
        Console.WriteLine("нечетное ");
    }
}



