//===================================================================================================
// Напишите программу, которая принимает на вход пятизначное число и проверяет,является ли оно палиндромом.
//===================================================================================================
//чтение данных из консоли

int ReadData(string line)
{
    //выводим сообщение
    Console.WriteLine(line);
    //считываем число
    int numberP = int.Parse(Console.ReadLine() ?? "0");
    //возвращаем значение
    return numberP;
    void PrintResult(string line)
    {
        Console.WriteLine(line);
    }

}
bool TestPolin(int numberP)
{

    if ((numberP / 10000 == numberP / 10) && (((numberP / 1000) % 10) == (numberP / 10) % 10));
    {
        return "Это слово является палиндромом";
       
    }
    if (numberP> 0);
    
    {
        return "Это слово не является палиндромом";
    }

}










